In [2]:
# Establish a connection between Python and the Sakila database.

import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input
password = getpass.getpass()

In [3]:
bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [4]:
from sqlalchemy import text

with engine.connect() as connection:
    query = text('SELECT * FROM film')
    result = connection.execute(query)

result

In [13]:
# Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters)
# from the Sakila database as a Pandas DataFrame. The function should take in three parameters:
#    engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
#    month: an integer representing the month for which rental data is to be retrieved.
#    year: an integer representing the year for which rental data is to be retrieved.
# The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database,
# and return it as a pandas DataFrame.

In [5]:
def rentals_month(engine, year, month):
    with engine.connect() as connection:
        query = text(f'select * from rental where rental_date like "{year}-{month}%"')
        result = connection.execute(query)
        df = pd.DataFrame(result.all())
        return df
    
df_rentals = rentals_month(engine, "2005", "06")

df_rentals

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
2306,3465,2005-06-21 22:10:01,1488,510,2005-06-30 21:35:01,1,2006-02-15 21:30:53
2307,3466,2005-06-21 22:13:33,371,226,2005-06-25 21:01:33,2,2006-02-15 21:30:53
2308,3467,2005-06-21 22:19:25,729,543,2005-06-27 00:03:25,2,2006-02-15 21:30:53
2309,3468,2005-06-21 22:43:45,2899,100,2005-06-30 01:49:45,1,2006-02-15 21:30:53
2310,3469,2005-06-21 22:48:59,4087,181,2005-06-28 19:32:59,1,2006-02-15 21:30:53

In [6]:
# Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns
# a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.
# The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example,
# if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".
# Hint: Consider making use of pandas groupby()

def rental_count_month(rentals_month, year, month):
    rental_counts = rentals_month.groupby("customer_id").size().reset_index(name=f"rentals_{month}_{year}")
    return rental_counts

df_counts = rental_count_month(rentals_month(engine, "2005", "06"), "2005", "06")

df_counts

     customer_id  rentals_06_2005
0              1                7
1              2                1
2              3                4
3              4                6
4              5                5
..           ...              ...
585          595                2
586          596                2
587          597                3
588          598                1
589          599                4

[590 rows x 2 columns]

In [7]:
#Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months
# and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.


def compare_rentals(df1, df2):
    df_merged = pd.merge(df1, df2, on="customer_id", how="outer").fillna(0)

    # Identify the two rental columns dynamically
    rental_cols = [col for col in df_merged.columns if col.startswith("rentals_")]

    # Compute the difference between the two months
    df_merged["difference"] = df_merged[rental_cols[1]] - df_merged[rental_cols[0]]

    return df_merged

final = compare_rentals(rental_count_month(rentals_month(engine, "2005", "07"), "2005", "07"), rental_count_month(rentals_month(engine, "2005", "06"), "2005", "06"))

final

     customer_id  rentals_07_2005  rentals_06_2005  difference
0              1               12              7.0        -5.0
1              2               14              1.0       -13.0
2              3               13              4.0        -9.0
3              4                5              6.0         1.0
4              5               16              5.0       -11.0
..           ...              ...              ...         ...
594          595               19              2.0       -17.0
595          596                6              2.0        -4.0
596          597                7              3.0        -4.0
597          598               16              1.0       -15.0
598          599                7              4.0        -3.0

[599 rows x 4 columns]